In [1]:
import pandas as pd
import numpy as np

In [21]:
d = {'one': pd.Series([1, 2, 3.], index=['a', 'b', 'c']),
   ....:      'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 1, 'd'])}

a=pd.Series([1, 2, 3.], index=['a', 'b', 'd'])
b=pd.Series([1, 2, 3.,7], index=['d', 1, 'c','b'])

print(a)
print(b)

a+b

a    1.0
b    2.0
d    3.0
dtype: float64
d    1.0
1    2.0
c    3.0
b    7.0
dtype: float64

1    NaN
a    NaN
b    9.0
c    NaN
d    4.0
dtype: float64

In [22]:
df = pd.DataFrame(d)

In [23]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  NaN
1  NaN  3.0
d  NaN  4.0

In [24]:
print(df['one']) # select by column
d['one']

a    1.0
b    2.0
c    3.0
1    NaN
d    NaN
Name: one, dtype: float64

a    1.0
b    2.0
c    3.0
dtype: float64

In [25]:
df['one'][1]

nan

In [12]:
df.loc['b'] # select by row label

one    2.0
two    2.0
Name: b, dtype: float64

In [19]:
df.iloc[2] # select by row index

one    3.0
two    3.0
Name: c, dtype: float64

In [20]:
df.loc[df['one']>1] # select row conditional SELECT * FROM DF WHERE ONE > 1

   one  two
b  2.0  2.0
c  3.0  3.0

In [16]:
df[df['one']>1] # same as before but shorter

   one  two
b  2.0  2.0
c  3.0  3.0

In [42]:
df[(df['one']>1) & (df['one']<3)]['two'] # SELECT TWO FROM DF WHERE ONE > 1

b    2.0
Name: two, dtype: float64

In [17]:
#Transpose
df[:].T

       a    b    c    d
one  1.0  2.0  3.0  NaN
two  1.0  2.0  3.0  4.0